Documents/СписаниеСРасчетногоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СписаниеСРасчетногоСчета</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровИМатериалов</xr:Item>
				<xr:Item>Document.ПоступлениеУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСписанияСРасчетногоСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СписаниеСРасчетногоСчета/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьВидимость()
	ЭтоСнятиеНаличныхВКассу = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияСРасчетногоСчета.СнятиеНаличныхВКассу"));
	ЭтоОплатаПоставщику  = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияСРасчетногоСчета.ОплатаПоставщику"));
	ЭтоВозвратПокупателю = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияСРасчетногоСчета.ВозвратПокупателю"));
	ЭтоПереводНаДругойСчет = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияСРасчетногоСчета.ПереводНаДругойСчетПредприятия"));
	
	КонтрагентЯвляетсяПоставщиком = КонтрагентЯвляетсяПоставщиком(Объект.Получатель);
	
	Элементы.Получатель.Видимость = Не (ЭтоСнятиеНаличныхВКассу ИЛИ ЭтоПереводНаДругойСчет);
	Элементы.Касса.Видимость = ЭтоСнятиеНаличныхВКассу;
	Элементы.ДоговорКонтрагента.Видимость = (ЭтоОплатаПоставщику ИЛИ ЭтоВозвратПокупателю) И КонтрагентЯвляетсяПоставщиком;
	Элементы.СчетПолучатель.Видимость = ЭтоПереводНаДругойСчет;
	СтрокаТипПолучателя = "СправочникСсылка.Сотрудники";
    Если ЭтоОплатаПоставщику ИЛИ ЭтоВозвратПокупателю Тогда
        СтрокаТипПолучателя = "СправочникСсылка.Контрагенты";
    КонецЕсли;
    
    Массив = Новый Массив();
    Массив.Добавить(Тип(СтрокаТипПолучателя));
    
    ОписаниеТипаПолучателя = Новый ОписаниеТипов(Массив);
    Элементы.Получатель.ОграничениеТипа = ОписаниеТипаПолучателя;
КонецПроцедуры

&НаСервереБезКонтекста
Функция КонтрагентЯвляетсяПоставщиком(КонтрагентСсылка)
	Если ТипЗнч(КонтрагентСсылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("КонтрагентСсылка",КонтрагентСсылка);
		Запрос.УстановитьПараметр("ТипКонтрагентаКлиент",Перечисления.ТипыКонтрагентов.Клиент);
		Запрос.Текст = "ВЫБРАТЬ
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка = &КонтрагентСсылка
		               |	И Контрагенты.ТипКонтрагента = &ТипКонтрагентаКлиент";
		Результат = Запрос.Выполнить();
		Возврат Результат.Пустой(); 
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный)Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры
